Public Attributes | List of all members
API_GridMesh Struct Reference
Element Manager API
Describes a Curtain Wall segment geometry. More...
#include <APIdefs_Base.h>
 Public Attributes
bool  | useIDs
For internal use.
API_GridElemID  | lowerLeftPolyID
The identifier of the left lower grid mesh polygon.
API_GridElemID  | lowerRightPolyID
The identifier of the right lower grid mesh polygon.
GS::Array< API_GridMeshLine >  | meshLinesMainAxis
Array of Grid Lines belong to the main axis (vertical).
GS::Array< API_GridMeshLine >  | meshLinesSecondaryAxis
Array of Grid Lines belong to the secondary axis (horizontal).
GS::HashTable< API_GridElemID, API_GridMeshVertex >  | meshVertices
Table of grid mesh vertices with identifier keys.
GS::HashTable< API_GridElemID, API_GridMeshPolygon >  | meshPolygons
Table of grid mesh polygons with identifier keys.
GS::HashTable< API_GridElemID, API_GridMeshEdge >  | meshEdgesMainAxis
Table of Grid Edges belong to the main axis (vertical).
GS::HashTable< API_GridElemID, API_GridMeshEdge >  | meshEdgesSecondaryAxis
Table of Grid Edges belong to the secondary axis (horizontal).
API_GridElemID  | cornerPointIDs [4]
the identifiers for the Lower left, lower right, upper right and upper left vertices of the grid mesh.
Detailed Description
Describes a Curtain Wall segment geometry.
Remarks
Member Data Documentation
◆ cornerPointIDs
 API_GridMesh::cornerPointIDs
the identifiers for the Lower left, lower right, upper right and upper left vertices of the grid mesh.
◆ lowerLeftPolyID
 API_GridMesh::lowerLeftPolyID
The identifier of the left lower grid mesh polygon.
◆ lowerRightPolyID
 API_GridMesh::lowerRightPolyID
The identifier of the right lower grid mesh polygon.
◆ meshEdgesMainAxis
 API_GridMesh::meshEdgesMainAxis
Table of Grid Edges belong to the main axis (vertical).
◆ meshEdgesSecondaryAxis
 API_GridMesh::meshEdgesSecondaryAxis
Table of Grid Edges belong to the secondary axis (horizontal).
◆ meshLinesMainAxis
 API_GridMesh::meshLinesMainAxis
Array of Grid Lines belong to the main axis (vertical).
◆ meshLinesSecondaryAxis
 API_GridMesh::meshLinesSecondaryAxis
Array of Grid Lines belong to the secondary axis (horizontal).
◆ meshPolygons
 API_GridMesh::meshPolygons
Table of grid mesh polygons with identifier keys.
◆ meshVertices
 API_GridMesh::meshVertices
Table of grid mesh vertices with identifier keys.
◆ useIDs
 API_GridMesh::useIDs
For internal use.